---
type: ApplicationEntryPoint
namespace: Autodesk.Revit.UI.Macros
version: 2024
members: 18
tags: [revit-api, class]
---

# ApplicationEntryPoint

`Autodesk.Revit.UI.Macros.ApplicationEntryPoint` · Revit 2024 · 18 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ApplicationEntryPoint | — | `public ApplicationEntryPoint ()` |
| Constructor | ApplicationEntryPoint | — | `public ApplicationEntryPoint ()` |
| Method | CreateRibbonPanel | — | `` |
| Method | CreateRibbonTab | — | `public override void CreateRibbonTab ( string tabName )` |
| Method | FinishInitializationEO | 2014 | `public void FinishInitializationEO ()` |
| Method | FinishInitializationEO | — | `public void FinishInitializationEO ()` |
| Method | GetRibbonPanels | — | `` |
| Method | GetRibbonPanels | — | `public override List < RibbonPanel > GetRibbonPanels ()` |
| Method | Initialize | 2014 | `public void Initialize ( Object obj , string addinFolder )` |
| Method | Initialize | — | `public void Initialize ( Object obj , string addinFolder )` |
| Method | NewProjectDocument | — | `` |
| Method | OnShutdownEO | 2014 | `public void OnShutdownEO ()` |
| Method | OnShutdownEO | — | `public void OnShutdownEO ()` |
| Method | OpenAndActivateDocument | — | `` |
| Method | OpenDocumentFile | — | `` |
| Method | OpenIFCDocument | — | `` |
| Property | AddinFolder | 2014 | `public string AddinFolder { get ; }` |
| Property | AddinFolder | — | `public string AddinFolder { get ; }` |